/**
 *******************************************************************************************
 * @file    uart_hal.c
 * @brief   51单片机串口通信程序源文件（hal） — 适用于 STC89C516RD+ 型号单片机并兼容 STC89 系列单片机
 * @version 1.0.0
 * @author  ForeverMySunyu
 * @date    2025-12-22
 *******************************************************************************************
*/

#include "../bsp/uart_bsp.h"
#include "uart_hal.h"



/* ================== API 函数定义区域 ================== */

/**
 * @brief hal 串口初始化函数
 */
void uart_init_hal(void)
{
    uart_init_bsp();
}