/**
 ******************************************************************************************************************
 * @file    timer.c
 * @brief   51单片机 core 层定时器初始化及中断服务程序源文件 — 适用于 STC89C516RD+ 型号单片机并兼容 STC89 系列单片机
 * @version 1.0.0
 * @author  ForeverMySunyu
 * @date    2025-12-13
 ******************************************************************************************************************
*/

#include "timer.h"

void Timer0_Init(void)


void Timer1_Init(void)


void Timer2_Init(void)


