/**
 ******************************************************************************************************************
 * @file    timer.h
 * @brief   51单片机 core 层定时器初始化及中断服务程序头文件 — 适用于 STC89C516RD+ 型号单片机并兼容 STC89 系列单片机
 * @version 1.2.0
 * @author  ForeverMySunyu
 * @date    2025-12-17
 ******************************************************************************************************************
*/

#ifndef _TIMER_H_
#define _TIMER_H_

/* ===================== 定时器初始化函数声明区 ======================== */
void Timer0_Init(void);         //! 定时器0初始化函数
void Timer1_Init(void);         //! 定时器1初始化函数
void Timer2_Init(void);         //! 定时器2初始化函数

/* ===================== 定义回调函数类型（定时器2中断服务程序） ======================== */
typedef void (*Timer2_Routine_Callback_t)(void);

/* ===================== 注册回调函数接口（供HAL层调用） ===================== */
void timer2_register_callback(Timer2_Routine_Callback_t cb);

#endif